app/Controllers/Backend.php

SELECT `j`.`nama`, COUNT(p.id) as total
FROM `pengguna` `p`
JOIN `jabatan` `j` ON `p`.`id_jabatan` = `j`.`id`
GROUP BY `p`.`id_jabatan`
---
    function charts()
    {
        # sql
        $db = \Config\Database::connect();
        $builder = $db->table('pengguna p');
        $builder->select('j.nama, COUNT(p.id) as total');
        $builder->join('jabatan j', 'p.id_jabatan = j.id');
        $builder->groupBy('p.id_jabatan');
        $query = $builder->get();