app/Models/AuthModel.php

SELECT `p`.`id`, `p`.`nama`, `p`.`email`, `p`.`password`, `p`.`profil`, `j`.`nama` as `jabatan`
FROM `pengguna` `p`
JOIN `jabatan` `j` ON `p`.`id_jabatan` = `j`.`id`
WHERE `p`.`email` = 'wanda@gmail.com'
---
	public function process_login(string $email, string $password)
	{
		if (empty($email) || empty($password)) {
			return false; # email atau password tidak ada di parameter
    	}
    	$pengguna = $this->db->table('pengguna p')
    						->select('p.id, p.nama, p.email, p.password, p.profil, j.nama as jabatan')
    						->join('jabatan j', 'p.id_jabatan = j.id')
    						->where('p.email', $email)
    						->get()
    						->getRow();